Repository: sepehr/uc-parsian
Catalog: translations/uc_parsian.*.po
Languages: fa

source: Could not request pin payment. Status: @code
fa: دریافت اطلاعات پرداخت از بانک پارسیان امکان پذیر نیست. وضعیت: @code

source: Could not recieve valid authorities and status codes from Parsian bank. Operation cancelled.
fa: امکان دریافت وضعیت پرداخت از بانک پارسیان موجود نیست. عملیات لغو شد.

source: The order status is not in checkout. You are not authorized to checkout this order.
fa: وضعیت سفارش شما قابل پرداخت نیست. شما اجازه لازم برای تصفیه حساب این سفارش را ندارید.

source: Could not validate your payment, Enquiry failed. Status: @code
fa: امکان معتبرسازی فرآیند پرداخت نیست. وضعیت: @code

source: Total amount of !amount has been successfully paid via !method by the customer. Payment transaction number is !authority.
fa: سرجمع هزینه !amount با استفاده از روش !method به صورت موفقیت آمیز پرداخت شد. شماره تراکنش پرداخت شما: !authority

source: The price has been successfully paid for this order.
fa: هزینه مورد نظر بابت این سفارش به صورت موفقیت آمیز پرداخت شد.

source: Your Parsian bank payment transaction number is !authority.
fa: شماره تراکنش پرداخت شما از طریق بانک پارسیان: !authority

source: Could not connect to Parsian webservice.
fa: امکان اتصال به سرویس بانک پارسیان موجود نیست.

source: Invalid PIN or IP.
fa: پین یا IP آدرس غیر معتبر.

source: The operation has been done previously.
fa: عملیات پیش از این با موفقیت انجام گرفته است.

source: Invalid transaction number.
fa: شماره تراکنش غیرمعتبر.

source: Unknown status code. Refer to your technical documentation or contact Parsian bank support.
fa: کد وضعیت ناشناخته. لطفا به مستندات تکنیکی پرداخت پارسیان مراجعه یا با پشتیبانی تماس حاصل فرمایید.

source: Parsian Bank
fa: بانک پارسیان

source: Pay via Parsian Bank
fa: پرداخت از طریق بانک پارسیان

source: Redirect to Parsian bank to pay by your debit card.
fa: انتقال به بانک پارسیان به منظور پرداخت با استفاده از کارت نقدی شما.

source: Parsian Authentication Pin
fa: پین معتبرسازی پارسیان

source: Enter your authentication key which has been bundled with your server IP address by Parsian Bank.
fa: پین معتبرسازی‌ای که با IP آدرس سرور شما توسط بانک پارسیان ثبت شده است را، وارد فرمایید.

source: Parsian Gateway Address
fa: آدرس دروازه پرداخت بانک پارسیان

source: Do not change the default value unless you checked that Parsian technical documentation.
fa: لطفا مقدار پیش‌فرض را تغییر ندهید، مگر اینکه این آدرس با آدرسی که در مستندات بانک پارسیان شما آمده، متفاوت باشد.

source: Parsian SOAP Server Endpoint
fa: آدرس سرور SOAP بانک پارسیان

source: Do not change this, too. Unless you check that technical documentation.
fa: لطفا این مقدار پیش‌فرض را هم تغییر ندهید، مگر اینکه این آدرس با آدرسی که در مستندات بانک پارسیان شما آمده، متفاوت باشد.

source: Additional Options
fa: دیگر اختیارات

source: Log payment process errors to Watchdog.
fa: ثبت خطا توسط Watchdog

source: If checked, all errors will be logged into Watchdog during the payment process.
fa: در صورتی که انتخاب شده باشد، تمامی خطاها در هنگام فرآیند پرداخت با استفاده از Watchdog در پایگاه داده ذخیره می‌شود.

source: Purge failed payment authority codes periodically.
fa: پاکسازی دوره‌ای کد تراکنش‌های ناموفق.

source: Authority codes of all successfull and failed Parsian payments will be collected. Check this to purge failed ones periodically using Cron.
fa: کد تمامی تراکنش‌های موفق و ناموفق ذخیره می‌شود. در صورتی که مایلید کد تراکنش‌های ناموفق به صورت دوره‌ای با استفاده از Cron پاکسازی شوند این گزینه را انتخاب کنید.

source: Orphan authority records generated by failed Parsian payments has been successfully removed.
fa: کد تراکنش‌های ناموفق به صورت موفقیت آمیز پاکسازی شد.

source: Order payment request
fa: درخواست پرداخت سفارش

source: Order payment complete
fa: کامل‌سازی پرداخت سفارش

source: Process payments using Parsian Bank gateway.
fa: پردازش پرداخت‌ها از طریق دروازه الکترونیکی بانک پارسیان.

source: Ubercart - payment
fa: Ubercart - پرداخت
